HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSent_bf.h
/** \\brief  Length for Ifx_SENT_CH_INTCLR_Bits.CRCI */
#define IFX_SENT_CH_INTCLR_CRCI_LEN (1)

/** \\brief  Mask for Ifx_SENT_CH_INTCLR_Bits.CRCI */
#define IFX_SENT_CH_INTCLR_CRCI_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_CH_INTCLR_Bits.CRCI */
#define IFX_SENT_CH_INTCLR_CRCI_OFF (9)

/** \\brief  Length for Ifx_SENT_CH_INTCLR_Bits.FDI */
#define IFX_SENT_CH_INTCLR_FDI_LEN (1)

/** \\brief  Mask for Ifx_SENT_CH_INTCLR_Bits.FDI */
#define IFX_SENT_CH_INTCLR_FDI_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_CH_INTCLR_Bits.FDI */
#define IFX_SENT_CH_INTCLR_FDI_OFF (6)

/** \\brief  Length for Ifx_SENT_CH_INTCLR_Bits.FRI */
#define IFX_SENT_CH_INTCLR_FRI_LEN (1)

/** \\brief  Mask for Ifx_SENT_CH_INTCLR_Bits.FRI */
#define IFX_SENT_CH_INTCLR_FRI_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_CH_INTCLR_Bits.FRI */
#define IFX_SENT_CH_INTCLR_FRI_OFF (5)

/** \\brief  Length for Ifx_SENT_CH_INTCLR_Bits.NNI */
#define IFX_SENT_CH_INTCLR_NNI_LEN (1)

/** \\brief  Mask for Ifx_SENT_CH_INTCLR_Bits.NNI */
#define IFX_SENT_CH_INTCLR_NNI_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_CH_INTCLR_Bits.NNI */
#define IFX_SENT_CH_INTCLR_NNI_OFF (7)

/** \\brief  Length for Ifx_SENT_CH_INTCLR_Bits.NVI */
#define IFX_SENT_CH_INTCLR_NVI_LEN (1)

/** \\brief  Mask for Ifx_SENT_CH_INTCLR_Bits.NVI */
#define IFX_SENT_CH_INTCLR_NVI_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_CH_INTCLR_Bits.NVI */
#define IFX_SENT_CH_INTCLR_NVI_OFF (8)

/** \\brief  Length for Ifx_SENT_CH_INTCLR_Bits.RBI */
#define IFX_SENT_CH_INTCLR_RBI_LEN (1)

/** \\brief  Mask for Ifx_SENT_CH_INTCLR_Bits.RBI */
#define IFX_SENT_CH_INTCLR_RBI_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_CH_INTCLR_Bits.RBI */
#define IFX_SENT_CH_INTCLR_RBI_OFF (2)

/** \\brief  Length for Ifx_SENT_CH_INTCLR_Bits.RDI */
#define IFX_SENT_CH_INTCLR_RDI_LEN (1)

/** \\brief  Mask for Ifx_SENT_CH_INTCLR_Bits.RDI */
#define IFX_SENT_CH_INTCLR_RDI_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_CH_INTCLR_Bits.RDI */
#define IFX_SENT_CH_INTCLR_RDI_OFF (1)

/** \\brief  Length for Ifx_SENT_CH_INTCLR_Bits.RSI */
#define IFX_SENT_CH_INTCLR_RSI_LEN (1)

/** \\brief  Mask for Ifx_SENT_CH_INTCLR_Bits.RSI */
#define IFX_SENT_CH_INTCLR_RSI_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_CH_INTCLR_Bits.RSI */
#define IFX_SENT_CH_INTCLR_RSI_OFF (0)

/** \\brief  Length for Ifx_SENT_CH_INTCLR_Bits.SCRI */
#define IFX_SENT_CH_INTCLR_SCRI_LEN (1)

/** \\brief  Mask for Ifx_SENT_CH_INTCLR_Bits.SCRI */
#define IFX_SENT_CH_INTCLR_SCRI_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_CH_INTCLR_Bits.SCRI */
#define IFX_SENT_CH_INTCLR_SCRI_OFF (12)

/** \\brief  Length for Ifx_SENT_CH_INTCLR_Bits.SDI */
#define IFX_SENT_CH_INTCLR_SDI_LEN (1)

/** \\brief  Mask for Ifx_SENT_CH_INTCLR_Bits.SDI */
#define IFX_SENT_CH_INTCLR_SDI_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_CH_INTCLR_Bits.SDI */
#define IFX_SENT_CH_INTCLR_SDI_OFF (11)

/** \\brief  Length for Ifx_SENT_CH_INTCLR_Bits.TBI */
#define IFX_SENT_CH_INTCLR_TBI_LEN (1)

/** \\brief  Mask for Ifx_SENT_CH_INTCLR_Bits.TBI */
#define IFX_SENT_CH_INTCLR_TBI_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_CH_INTCLR_Bits.TBI */
#define IFX_SENT_CH_INTCLR_TBI_OFF (4)

/** \\brief  Length for Ifx_SENT_CH_INTCLR_Bits.TDI */
#define IFX_SENT_CH_INTCLR_TDI_LEN (1)

/** \\brief  Mask for Ifx_SENT_CH_INTCLR_Bits.TDI */
#define IFX_SENT_CH_INTCLR_TDI_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_CH_INTCLR_Bits.TDI */
#define IFX_SENT_CH_INTCLR_TDI_OFF (3)

/** \\brief  Length for Ifx_SENT_CH_INTCLR_Bits.WDI */
#define IFX_SENT_CH_INTCLR_WDI_LEN (1)

/** \\brief  Mask for Ifx_SENT_CH_INTCLR_Bits.WDI */
#define IFX_SENT_CH_INTCLR_WDI_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_CH_INTCLR_Bits.WDI */
#define IFX_SENT_CH_INTCLR_WDI_OFF (13)

/** \\brief  Length for Ifx_SENT_CH_INTCLR_Bits.WSI */
#define IFX_SENT_CH_INTCLR_WSI_LEN (1)

/** \\brief  Mask for Ifx_SENT_CH_INTCLR_Bits.WSI */
#define IFX_SENT_CH_INTCLR_WSI_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_CH_INTCLR_Bits.WSI */
#define IFX_SENT_CH_INTCLR_WSI_OFF (10)

/** \\brief  Length for Ifx_SENT_CH_INTEN_Bits.CRCI */
#define IFX_SENT_CH_INTEN_CRCI_LEN (1)

/** \\brief  Mask for Ifx_SENT_CH_INTEN_Bits.CRCI */
#define IFX_SENT_CH_INTEN_CRCI_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_CH_INTEN_Bits.CRCI */
#define IFX_SENT_CH_INTEN_CRCI_OFF (9)

/** \\brief  Length for Ifx_SENT_CH_INTEN_Bits.FDI */
#define IFX_SENT_CH_INTEN_FDI_LEN (1)

/** \\brief  Mask for Ifx_SENT_CH_INTEN_Bits.FDI */
#define IFX_SENT_CH_INTEN_FDI_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_CH_INTEN_Bits.FDI */
#define IFX_SENT_CH_INTEN_FDI_OFF (6)

/** \\brief  Length for Ifx_SENT_CH_INTEN_Bits.FRI */
#define IFX_SENT_CH_INTEN_FRI_LEN (1)

/** \\brief  Mask for Ifx_SENT_CH_INTEN_Bits.FRI */
#define IFX_SENT_CH_INTEN_FRI_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_CH_INTEN_Bits.FRI */
#define IFX_SENT_CH_INTEN_FRI_OFF (5)

/** \\brief  Length for Ifx_SENT_CH_INTEN_Bits.NNI */
#define IFX_SENT_CH_INTEN_NNI_LEN (1)

/** \\brief  Mask for Ifx_SENT_CH_INTEN_Bits.NNI */
#define IFX_SENT_CH_INTEN_NNI_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_CH_INTEN_Bits.NNI */
#define IFX_SENT_CH_INTEN_NNI_OFF (7)

/** \\brief  Length for Ifx_SENT_CH_INTEN_Bits.NVI */
#define IFX_SENT_CH_INTEN_NVI_LEN (1)

/** \\brief  Mask for Ifx_SENT_CH_INTEN_Bits.NVI */
#define IFX_SENT_CH_INTEN_NVI_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_CH_INTEN_Bits.NVI */
#define IFX_SENT_CH_INTEN_NVI_OFF (8)

/** \\brief  Length for Ifx_SENT_CH_INTEN_Bits.RBI */
#define IFX_SENT_CH_INTEN_RBI_LEN (1)

/** \\brief  Mask for Ifx_SENT_CH_INTEN_Bits.RBI */
#define IFX_SENT_CH_INTEN_RBI_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_CH_INTEN_Bits.RBI */
#define IFX_SENT_CH_INTEN_RBI_OFF (2)

/** \\brief  Length for Ifx_SENT_CH_INTEN_Bits.RDI */
#define IFX_SENT_CH_INTEN_RDI_LEN (1)

/** \\brief  Mask for Ifx_SENT_CH_INTEN_Bits.RDI */
#define IFX_SENT_CH_INTEN_RDI_MSK (0x1)

/** \\brief  Offset for Ifx_SENT_CH_INTEN_Bits.RDI */
#define IFX_SENT_CH_INTEN_RDI_OFF (1)

/** \\brief  Length for Ifx_SENT_CH_INTEN_Bits.RSI */
#define IFX_SENT_CH_INTEN_RSI_LEN (1)

